package Beginig.Array;

/*
Реализуйте метод, который будет принимать массив чисел и выводить его значения в консоль c помощью методов класса Arrays.
Пример ввода: {1,2,3,4,5,5,6,7,7}
Пример вывода: [1, 2, 3, 4, 5, 5, 6, 7, 7]
 */

import java.util.Arrays;

public class PrintArray2 {
    public static void printArray(int[] numbers) {
        System.out.println(Arrays.toString(numbers));
    }
}
